<?xml version="1.0" ?>
<net name="point_history_classifier_FINAL_MYRIAD_COMPAT" version="10">
	<layers>
		<layer id="0" name="score_threshold/const_placeholder/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="sequential/dense/Relu;sequential/dense/BiasAdd/1_port_transpose690_const" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="24,32" size="1536"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="sequential/dense/Relu;sequential/dense/BiasAdd" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx_initializer_node_sequential/dense/BiasAdd/ReadVariableOp/resource/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1538" shape="1,24" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Add__10" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Relu__7" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sequential/dense_1/Relu;sequential/dense_1/BiasAdd/1_port_transpose694_const" type="Const" version="opset1">
			<data element_type="f16" offset="1586" shape="10,24" size="480"/>
			<output>
				<port id="1" precision="FP16">
					<dim>10</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sequential/dense_1/Relu;sequential/dense_1/BiasAdd" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="onnx_initializer_node_sequential/dense_1/BiasAdd/ReadVariableOp/resource/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2066" shape="1,10" size="20"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Add__15" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Relu__12" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="sequential/dense_2/BiasAdd/1_port_transpose686_const" type="Const" version="opset1">
			<data element_type="f16" offset="2086" shape="4,10" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="sequential/dense_2/BiasAdd" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="onnx_initializer_node_sequential/dense_2/BiasAdd/ReadVariableOp/resource/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2166" shape="1,4" size="8"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Add__18" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Identity" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="ReduceMax_0/Cast_1935_const" type="Const" version="opset1">
			<data element_type="i64" offset="2174" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ReduceMax_0" type="ReduceMax" version="opset1">
			<data keep_dims="False"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Less_2_Sub/sub" type="Subtract" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Less_2_Clip" type="Clamp" version="opset1">
			<data max="1.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Less_2_Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx_initializer_node_onnx::Where_6/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2182" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul1" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Const_1/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2184" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Sub1/sub" type="Subtract" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="313/Cast_1937_const" type="Const" version="opset1">
			<data element_type="i32" offset="2186" shape="" size="4"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="27" name="313" type="TopK" version="opset1">
			<data axis="1" mode="max" sort="index"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="36/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="2174" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ArgMax_1/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="AutoCast_2" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Mul2" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Add1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Add1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
			</input>
		</layer>
		<layer id="34" name="313/Result_port_0/" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="1" from-port="0" to-layer="3" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1"/>
		<edge from-layer="3" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="0" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="25" to-port="1"/>
		<edge from-layer="16" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="1"/>
		<edge from-layer="27" from-port="3" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="25" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="27" from-port="2" to-layer="34" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{'score_threshold': '0.5'}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input value="input,score_threshold"/>
			<input_model value="DIR\point_history_classifier_FINAL_MYRIAD_COMPAT.onnx"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,32],[1]"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="point_history_classifier_FINAL_MYRIAD_COMPAT"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'input': array([ 1, 32], dtype=int64), 'score_threshold': array([1], dtype=int64)}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
